## Insert and Delete

In [1]:
import pandas as pd
var = pd.DataFrame({"A":[1,2,3,4],"B":[9,8,7,6]})
var

   A  B
0  1  9
1  2  8
2  3  7
3  4  6

In [2]:
var.insert(1,"Python",var["A"])

In [3]:
var

   A  Python  B
0  1       1  9
1  2       2  8
2  3       3  7
3  4       4  6

In [11]:
var.insert(1,"Id_num",[22,12,34,54])

In [12]:
var

   A  Id_num  Python_2  Python  B
0  1      22        22       1  9
1  2      12        12       2  8
2  3      34        34       3  7
3  4      54        54       4  6

In [13]:
import pandas as pd
var = pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,7]})
var

   A  B
0  1  9
1  2  8
2  3  7
3  4  6
4  5  7

In [14]:
var["Python_2"] = var["A"][:3]

In [15]:
var

   A  B  Python_2
0  1  9       1.0
1  2  8       2.0
2  3  7       3.0
3  4  6       NaN
4  5  7       NaN

## Delete

In [16]:
var.pop("B")

0    9
1    8
2    7
3    6
4    7
Name: B, dtype: int64

In [17]:
var

   A  Python_2
0  1       1.0
1  2       2.0
2  3       3.0
3  4       NaN
4  5       NaN

In [18]:
del var["A"]

In [19]:
var

   Python_2
0       1.0
1       2.0
2       3.0
3       NaN
4       NaN